In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

In [3]:
data = np.random.randint( -100 , 100 ,(4 ,4))

In [4]:
data

array([[ 27, -38,  90,  44],
       [ 43, -57, -15,  77],
       [-80,   3,  46, -64],
       [-82,  44,  47, -93]])

In [5]:
pd.DataFrame(data , columns=['A' , 'B' , 'C' , 'D'] , index=['a' , 'b' , 'c' , 'd'])

    A   B   C   D
a  27 -38  90  44
b  43 -57 -15  77
c -80   3  46 -64
d -82  44  47 -93

In [14]:
df = pd.DataFrame({
    'A' : [1 , 2 , np.nan , 4] ,
    'B' : [np.nan , 6 , 7 , np.nan] ,
    'C' : [9 , np.nan , 11 , 12] ,
    'D' : [13 , 14 , 2 , 16]
})

In [15]:
df

     A    B     C   D
0  1.0  NaN   9.0  13
1  2.0  6.0   NaN  14
2  NaN  7.0  11.0   2
3  4.0  NaN  12.0  16

In [17]:
df.dropna(axis=1)

    D
0  13
1  14
2   2
3  16